Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/buying_a_home/steps_involved_buying_a_home.html.txt.tmx
Source language: en
Languages: ga

source: Steps involved in buying a home
ga: Na céimeanna a bhaineann le teach a cheannach

source: At some point in your life you may wish to buy a home
ga: B’fhéidir go mbeadh fonn ort teach a cheannach am éigin i do shaol

source: This document covers the different stages involved
ga: Is cinneadh mór atá i gceist

source: The Competition and Consumer Protection Commission has a step-by-step guide to buying a home on its website
ga: Is próiseas deacair agus strusmhar é uaireanta

source: This is also available as a booklet (pdf)
ga: Breathnaítear anseo ar na céimeanna difriúla a bhaineann le teach a cheannach

source: Find out what you can afford
ga: Faigh amach cad atá tú in acmhainn a cheannach

source: It is important to evaluate all costs involved in buying a home, for example, mortgage costs, legal fees, registration of deeds and stamp duty. The amount of money that you can get as a mortgage loan is governed by Central Bank lending limits - see Taking out a mortgage for details of these rules
ga: Tá sé tábhachtach ag an tráth seo measúnú cúramach a dhéanamh ar na costais uile a bhaineann le teach a cheannach, cosúil le costais an mhorgáiste, táillí dlí, clárú gníomhas, dleacht stampála, srl

source: If you have calculated that you can afford to buy a property, taking all of these factors into account, then you are ready to buy
ga: Má mheasann tú ó do chuid suimeanna go bhfuil na hacmhainní agat leis na costais uile sin san áireamh, tá tú réidh chun teach a cheannach mar sin

source: Conveyancing is the legal work involved in buying or selling property
ga: Ní féidir an próiseas iomlán a bhaineann le ceannach nó díol tí a chur i gcrích mura bhfaigheann tú comhairle agus cúnamh dlí - tíolacadh a thugtar ar an réimse dlí speisialta seo

source: Conveyancing charges can vary between solicitors, so it is worth contacting several solicitors to compare prices
ga: Tíolacadh is ea an obair dhlíthiúil a bhaineann le teach a cheannach nó a dhíol

source: You can use the Law Society’s website to find a solicitor in your area
ga: Bíonn táillí tíolactha éagsúla ag aturnaetha difriúla, agus ba chóir duit teagmháil a dhéanamh le roinnt aturnaetha difriúla chun comparáid a dhéanamh idir praghsanna

source: Find a property you like and can afford
ga: Aimsigh maoin a thaitníonn leat agus atá inacmhainne

source: There is a public register of auctioneers and estate agents on the website of the Property Services Regulatory Authority
ga: Tá go leor bealaí ann chun teacht ar an maoin a theastaíonn uait a cheannach

source: Sometimes individual sellers advertise their property themselves Newspapers may also have property supplements or publish advertisements for properties for sale
ga: Is féidir leat liosta de cheantálaithe agus gníomhairí eastáit a fháil ar láithreán gréasáin an Údaráis Rialála Seirbhísí Maoine

source: The Property Services Regulatory Authority publishes a Residential Property Price Register
ga: Uaireanta, déanfaidh úinéirí aonair an tí díolachán na maoine a fhógairt go neamhspleách

source: It contains information on residential properties bought in Ireland since 1 January 2010. You can check the register to see what price was paid for a property if it was sold since that date
ga: Lena chois sin, d’fhéadfadh nuachtáin áitiúla agus náisiúnta forlíontaí maoine a fhoilsiú go seachtainiúil nó faisnéis a bheith iontu faoi mhaoin ar díol ina rannóg fógraíochta príobháidí

source: All homes for sale must have a Building Energy Rating (BER). A BER will inform you how energy-efficient the home is
ga: Ón 1 Eanáir 2009, caithfidh gach teach atá ar díol Rátáil Fuinnimh an Fhoirgnimh (BER) a bheith acu

source: It will help you make an informed choice when comparing properties
ga: Tabharfaidh BER le fios cé chomh tíosach ar fhuinneamh atá an teach

source: It also offers guidance on steps that can be taken to improve the energy efficiency of a property
ga: Cabhróidh sé leat rogha eolasach a dhéanamh nuair atá comparáid á dhéanamh agat idir maoine

source: The Environmental Protection Agency (EPA) recommends that you check whether the home is in a High Radon Area on its Radon Risk Map and enquire as to whether the home has been tested for radon
ga: Lena chois sin, tugann sé treoir maidir le céimeanna is féidir a ghlacadh chun éifeachtacht fuinnimh na maoine a fheabhsú

source: A seller is under no obligation to disclose defects in a property
ga: Is beag duine a bhfuil na hacmhainní acu chun teach a cheannach gan morgáiste a fháil

source: You should get a survey of the property to find out if there are any defects before finalising the purchase
ga: Is iasacht fadtéarmach é morgáiste atá urraithe i gcoinne na maoine a cheannaíonn tú

source: Very few people can buy a home without getting a mortgage. A mortgage is a long-term loan secured against the property you buy
ga: Ciallaíonn sé seo go bhféadfá do theach a chailliúint mura ndéantar do mhorgáiste a aisíoc

source: There are different types of mortgages and different mortgage providers
ga: Tá cineálacha difriúla morgáistí agus soláthraithe difriúla morgáistí ar fáil

source: Contact a number of different mortgage providers to find out who can offer you the best deal
ga: Déan teagmháil le roinnt soláthraithe morgáiste difriúla chun an margadh is fearr a fháil

source: More information on mortgages and choosing the best one for you is available from the Competition and Consumer Protection Commission
ga: Tuilleadh eolais faoi mhorgáistí agus an ceann is fearr a roghnú duit féin ar fáil ar láithreán gréasáin an Rialtóra Airgeadais

source: You can get mortgage approval in principle before you start to look for a property; this will let you know how much you have to spend
ga: Is féidir cead morgáiste a fháil i bprionsabal sula dtosaíonn tú ag cuardach maoine; beidh a fhios agat ar an mbealach sin cén t-airgead a bheidh agat le caitheamh

source: However, when you find a property you like, you must get formal mortgage approval before you sign the contract for sale (see below)
ga: Mar sin féin, nuair a thagann tú ar mhaoin a thaitníonn leat, ní mór duit cead foirmiúil ar mhorgáiste a fháil sula síníonn tú conradh díolacháin (féach thíos)

source: If you sign a contract for sale and subsequently don’t get mortgage approval, you will lose your deposit and there may be other penalties
ga: Má shíníonn tú conradh díolacháin agus nach bhfaigheann tú cead ar mhorgáiste ina dhiaidh sin, caillfidh tú d’éarlais 10% agus d’fhéadfadh pionóis eile a bheith i gceist freisin

source: For more detailed information, see our document on taking out a mortgage
ga: Conas an mhaoin a thaitníonn leat a cheannach

source: How to buy the property you want
ga: An dá mhodh is coitianta chun maoin a cheannach agus a dhíol in Éirinn ná:

source: The two most popular methods by which properties are purchased and sold are: • Private treaty sales
ga: • Díolacháin trí chonradh príobháideach

source: A private treaty sale is where the property is not put into an auction
ga: Tarlaíonn díolachán trí chonradh príobháideach nuair nach ndéantar maoin a chur ar ceant go poiblí

source: You can contact the seller or the seller’s agent, usually an estate agent, to agree a purchase price
ga: Is féidir leat teagmháil a dhéanamh leis an díoltóir nó le gníomhaire an díoltóra, an gníomhaire eastáit go hiondúil, chun aontú ar phraghas ceannaigh

source: If there is an estate agent involved, once you have agreed to buy the property you may be required to pay a booking deposit to the estate agent
ga: Má bhíonn gníomhaire eastáit bainteach leis an bpróiseas, féadfaidh dualgas a bheith ort éarlais áirithinte a íoc leis an ngníomhaire eastáit chomh luath agus a aontaíonn tú an mhaoin a cheannach

source: The legal process to buy the property may only start when the estate agent receives your booking deposit
ga: Ní féidir tús a chur leis an bpróiseas dlí a bhaineann le teach a cheannach go dtí go bhfaigheann an gníomhaire eastáit d’éarlais áirithinte

source: This deposit is refundable up to the signing of the contract for sale (see below)
ga: Bíonn an éarlais sin inaisíoctha suas go dtí go sínítear an conradh díolacháin (féach thíos)

source: Your mortgage provider will give you formal mortgage approval and issue you with a loan pack
ga: Tabharfaidh do sholáthraí morgáiste cead morgáiste duit go foirmiúil agus eiseofar paca iasachta ort

source: You will need to think about mortgage protection insurance and home insurance
ga: Nuair a bhíonn do chonradh díolacháin seiceáilte ag d’aturnae, síneoidh tú é agus íocfar an éarlais 10% (lúide táille áirithinte ar bith)

source: You can organise these with your mortgage provider but it is advisable to shop around
ga: Beidh dualgas ort cosaint morgáiste agus árachas tí a fháil

source: When your solicitor has checked the contract for sale, you will sign it and pay a deposit (less any booking fee)
ga: Is féidir iad seo a eagrú le do sholáthraí morgáiste ach moltar duit breathnú ar sheirbhísí difriúla chun comparáid a dhéanamh

source: Notice of the date and time of the auction is usually advertised in a local newspaper, estate agent or by a sign on the property
ga: Déantar fógra faoi dháta agus am an cheant i nuachtán áitiúil, trí ghníomhaire eastáit nó trí chomhartha ar an maoin

source: The reserve figure is the value the property must achieve; anything below this and the property will be withdrawn from the market
ga: Socraítear figiúr forchoimeádta don mhaoin, a dhéanann an t-úinéir nó ceantálaí go hiondúil

source: At all times during the auction, however, the vendor (seller) can withdraw the property from the market, even if it has achieved the reserve figure. The vendor can also reserve the right to sell the property before the auction
ga: Is ionann an figiúr forchoimeádta agus an luach a chaithfidh an mhaoin a bhaint amach; déanfar an mhaoin a tharraingt den mhargadh mura ndéantar an figiúr sin a bhaint amach

source: Before the auction takes place, your solicitor should check the contract for sale for the property (issued by the seller's solicitor) and all title documents that are referred to in that contract
ga: Mar sin féin, ag gach tráth le linn an cheant, is féidir leis an díoltóir an mhaoin a tharraingt siar den mhargadh, fiú amháin má ghnóthaíonn an mhaoin an figiúr forchoimeádta

source: When your solicitor has satisfied his or her enquiries, you can organise a survey of the property to ensure it is sound
ga: Lena chois sin, is féidir leis an díoltóir ceart a choimeád acu féin an mhaoin a dhíol roimh dháta an cheant

source: The successful bidder immediately pays a deposit and signs the contract for sale (see below). It is important to get home insurance as soon as possible. Regulation of estate agents and auctioneers
ga: Sula mbíonn an ceant ar siúl, ba chóir don aturnae atá agat conradh na maoine a sheiceáil (eisithe ag aturnae an díoltóra) agus na doiciméid teidil a dtagraítear dóibh sa chonradh sin

source: Under the Property Services (Regulation) Act 2011, estate agents and auctioneers are regulated by the Property Services Regulatory Authority
ga: Nuair a bhíonn d’aturnae sásta lena f(h)iosruithe, is féidir leat suirbhé a eagrú maidir leis an mhaoin chun cinntiú go bhfuil sí slán

source: It is important to remember that the estate agent or auctioneer is acting on behalf of the seller and is acting in the seller’s interest
ga: Moltar duit freisin cead ar mhorgáiste a fháil go foirmiúil maidir leis an mhaoin ar mian leat tairiscint a dhéanamh ina leith

source: If you have a complaint against an estate agent or auctioneer, you can write to the PSRA - see 'Where to apply' below. You can use this complaint form (pdf) to structure your complaint if you choose
ga: Íocann an tairgeoir rathúil éarlais (10% den phraghas iarrata) láithreach agus síníonn sé/sí an conradh díolacháin (féach thíos)

source: Include as much evidence as you can and give your postal address
ga: Tá sé tábhachtach árachas tí a fháil chomh luath agus is féidir

source: Sign the contract for sale
ga: An conradh díolacháin a shíniú

source: The contract for sale binds the parties to the completion of the sale
ga: Ceanglaíonn an conradh díolacháin na páirtithe do dtí deireadh an díolacháin

source: If you withdraw from the sale after this contract has been signed, you may lose your deposit
ga: Má tharraingíonn tú siar ón díolachán tar éis don chonradh seo a bheith sínithe, d’fhéadfá d’éarlais a chailliúint

source: If you buy at auction you must immediately sign the contract for sale. If you buy through private treaty your solicitor will check that the contract is in order before you sign it
ga: Caithfidh tú conradh díolacháin a shíniú láithreach nuair a cheannaíonn tú ag ceant, má cheannaíonn tú trí chonradh príobháideach déanfaidh d’aturnae an conradh a sheiceáil chun cinntiú go bhfuil gach rud in ord sula sínítear an conradh

source: In the case of new developments this contract for sale usually includes "building agreements" as most properties these days are sold and developed by the same company
ga: I gcás forbairtí nua, áirítear "comhaontuithe tógála" sa chonradh díolacháin go hiondúil mar bíonn go leor maoine díolta agus forbartha ag an gcomhlacht céanna na laethanta seo

source: In the past, but now rarely, one company would sell land to a buyer and a different company would build on it
ga: Roimhe seo, dhíoladh comhlacht amháin talamh le ceannaitheoir agus bhíodh comhlacht difriúil i mbun tógála, ach is annamh a tharlaíonn a leithéid anois

source: In such instances, the contract is actually a "contract for sale and building agreement" but in almost all residential sales, a contract is simply known as a contract for sale
ga: I gcásanna áirithe, is "conradh díolacháin agus comhaontú tógála" atá sa chonradh ach maidir le beagnach gach díolachán cónaithe, tugtar conradh díolacháin ar an gconradh go simplí

source: The completion date will be set out in the contract and the balance of the agreed purchase price will be due on that date
ga: Leagfar an dáta críochnaithe amach sa chonradh agus beidh iarmhéid an phraghais ceannaigh atá comhaontaithe dlite ar an dáta sin

source: Requisitions on Title and Deed of Conveyance
ga: Foréilimh ar Theideal agus Gníomhas Tíolactha

source: After signing the contract and before the completion date of the sale, your solicitor raises some general queries about the property with the seller's solicitor
ga: Tar éis an conradh a shíniú agus sula gcuirtear deireadh leis an díolachán, ardaíonn d’aturnae fiosruithe ginearálta faoin maoin le haturnae an díoltóra

source: Requisitions on Title are a standard set of questions relating to the sale of a property that deal with such things as whether fixtures and fittings are included in the sale
ga: Is éard is Foréilimh ar Theideal ná sraith ceisteanna caighdeánacha i ndáil le díolachán maoine a dhéileálann le rudaí cosúil le cibé an bhfuil daingneáin agus feistis san áireamh

source: When your solicitor gets a satisfactory reply to Requisitions on Title, a Deed of Conveyance is drafted by him or her and approved by the seller's solicitor
ga: Nuair a fhaigheann d’aturnae freagra sásúil ar an bhForéilimh ar Theideal, déanann sé/sí Gníomhas Tíolactha a dhréachtú agus a faomhann aturnae an díoltóra é

source: Your solicitor makes arrangements for searches to be made against the seller to ensure that there are no judgements lying against the seller (for example, bankruptcy or sheriffs' searches)
ga: Nuair a bhíonn an Gníomhas Tíolactha faofa ag aturnae an díoltóra, déanfaidh d’aturnae teagmháil le do sholáthraí morgáiste chun an seic iasachta faofa a eisiúint ón soláthraí morgáiste

source: Your solicitor should also conduct a search where the title to the property is held (either in the Land Registry or the Registry of Deeds) to ensure that there is nothing adverse attaching to the property, for example, an outstanding mortgage
ga: Seo í an iarmhéid fhuílligh ar an bpraghas ceannaigh. Déantar an íocaíocht le haturnae an díoltóra agus faigheann d’aturnae an doiciméadúchán uile, mar aon le heochracha an áitribh

source: Once the Deed of Conveyance is approved by the seller's solicitor, your solicitor will contact your mortgage provider to request the issue of the approved loan cheque
ga: Déanfaidh d’aturnae socrúcháin maidir le cuardaigh a dhéanamh i gcoinne an díoltóra chun cinntiú nach bhfuil breithiúnais ar bith i gcoinne an díoltóra (mar shampla, féimheacht nó cuardaigh ó shirriamaí)

source: This is the remaining balance of the purchase price. It is paid to the seller's solicitor and all documentation, and keys to the premises are handed over to your solicitor
ga: Ba chóir don aturnae atá agat cuardach a dhéanamh freisin san áit a bheidh teideal na maoine coinnithe (cibé i gClárlann na Talún nó i gClárlann na nGníomhas) chun cinntiú nach bhfuil rud ar bith as ord ag baint leis an mhaoin, mar shampla, morgáiste gan íoc

source: Your solicitor will calculate how much stamp duty is due and request this from you before the closing of the sale
ga: Ríomhfaidh d’aturnae an dleacht stampála atá dlite agus iarrfar ort é seo a íoc sula gcuirtear clabhsúr leis an díolachán

source: The stamp duty is paid to the Revenue Commissioners, who place a stamp on the deeds
ga: Íoctar an méid seo leis na Coimisinéirí Ioncaim a leagann stampa ar na gníomhais

source: Without this stamp, the deeds cannot be registered
ga: Ní féidir na gníomhais a chlárú gan an stampa sin

source: The deeds name the owner of the property
ga: Ainmníonn na gníomhais úinéir na maoine

source: After the sale is completed
ga: Tar éis an díolachán a bheith déanta

source: Once a sale is completed, your deeds, showing the new ownership details and mortgage details, if relevant, must be registered with either the Registry of Deeds or the Land Registry
ga: Nuair a bhíonn díolachán déanta, caithfear do ghníomhais, a shonraíonn sonraí na húinéireachta nua agus sonraí morgáiste, más cuí, a chlárú le Clárlann na nGníomhas nó Clárlann na Talún

source: The Property Registration Authority (PRA) is responsible for both systems of registration
ga: Tá freagracht ar an Údarás Clárúcháin Maoine maidir leis na córais chlárúcháin thuasluaite

source: Your solicitor will continue to assist you with finalising the deeds to your house with the PRA
ga: Leanfaidh d’aturnae ag cabhrú leat gníomhais an tí a thabhairt chun críche leis an Údarás Clárúcháin Maoine

source: This can take from months to years to complete
ga: Tógann an próiseas seo rud ar bith idir míonna go dtí blianta

source: Even if it does take a long time, you are still the owner of the property and, if you wish, you can sell the property before registration is complete
ga: Fiú amháin má thógann sé tamall fada an próiseas a chur i gcrích, is tusa úinéir na maoine i gcónaí agus is féidir leat an mhaoin a dhíol sula ndéantar an próiseas clárúcháin a chur i gcrích

source: There are many things to do when moving house, for example, redirecting your post and changing your details on the electoral register
ga: Bíonn go leor rudaí le déanamh nuair atáthar ag bogadh tí, mar shampla, do phost a atreorú agus do shonraí a athrú ar an gclár toghthóirí

source: More information is available in our document on moving to a new home. Where to apply
ga: Tá tuilleadh eolais ar fáil inár ndoiciméad Ag bogadh go teach nua
